x1=[1 2 5 6 7 8 10 13 17];
y1=[3 3.7 3.9 4.2 5.7 6.6 7.1 6.7 4.5];
y01=1.000 ;          %  S'(x0)=f'(x0)=y0   
yn1=-0.67;          %  S'(xn)=f'(xn)=yn

x2=[17 20 23 24 25 27 27.7];
y2=[4.5 7 6.1 5.6 5.8 5.2 4.1];
y02=3;
yn2=-4;

x3=[27.7 28 29 30];
y3=[4.1 4.3 4.1 3];
y03=0.33;
yn3=-1.5;

x0=1:0.01:30;
s1=threesimple1(x1,y1,x0,y01,yn1);
s2=threesimple1(x2,y2,x0,y02,yn2);
s3=threesimple1(x3,y3,x0,y03,yn3);
s=[s1,s2,s3];
xx=[x0,x0,x0];
plot(xx,s)        %绘制第一边界条件插值函数图像
hold on
grid on
plot(x,y,'o')
axis([1 30 2.5 7.5])
xlabel('自变量 X'), ylabel('因变量 Y')
title('插值点与三次样条函数') 
legend('三次样条插值点坐标','插值点')
